[{"_date":"2015-10-16 00:00 ","items":[{"name":"Registration","description":"","_type":"Other","time":"08:15:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"Functional and Async JavaScript Tutorial","description":"<p>What’s does a mouse drag event have in common with an Array of numbers? The answer to this question may surprise you: they are both collections. This key insight holds the key to dramatically simplifying asynchronous programming in Javascript.</p>\n\n<p>In this tutorial you will learn how you can use the familiar Javascript Array methods to create surprisingly expressive asynchronous programs.</p>","_type":"Workshop","time":"09:00:00","speaker":{"id":15,"name":"Matthew Podwysocki","alias":"Matt","twitter_user":"mattpodwysocki","linkedin_user":"","image":"http://jsconf.co/media/speaker/mattPodwjpeg","about":"<p>Matthew Podwysocki is a Principal Software Engineer at self described Open Sourcerer at Microsoft. He currently works with the DX/TED team focusing on the Internet of Things, Reactive Programming at Scale and teaching the next generation how to code!</p>","job":"Microsoft Corporation","order":4,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":5,"name":"Workshops Room 3","description":"Second Floor"}},{"name":" Videojuegos con JavaScript & Box2D","description":"<p>Gracias a la gran acogida que ha tenido el estándar de html5 por las comunidades de desarrolladores web, los browsers ahora cubren un sin número de features de la especificación con mucha más fuerza que antes. Es por eso que hacer videojuegos con HTML5 Canvas y Javascript se ha vuelto un hobbie y en algún caso tan serio como para que muchos desarrolladores dediquen su vida a la creación de videojuegos que toman la web como su principal plataforma de distribución.</p>\n<p>En este taller vamos a enfocarnos en uno de los primeros pasos que debes aprender para la creación de videojuegos, y en este caso será el manejo de mecánicas basadas en Física desde cero y la implementación de simulaciones físicas con Box2D.</p>\n<p>Al terminar este taller, el asistente habrá aprendido:</p>\n<ol>\n<li>El uso de algunas formulas físicas aplicadas a mecánicas básicas de juego.</li>\n<li>La implementación de Box2D para la creación de simulaciones físicas.</li>\n<li>Integración de simulaciones de física con objetos en el Canvas</li>\n</ol>","_type":"Workshop","time":"09:00:00","speaker":{"id":22,"name":"Fredy E Mena Andrade","alias":"Xfry","twitter_user":"xfry","linkedin_user":"https://co.linkedin.com/in/fredyandrade","image":"http://jsconf.co/media/speaker/FredyMena.jpg","about":"<p>Engineer. Javascript developer, Lead organizer of <a href=\"http://www.hackdo.co/\">Hackdó</a>  and Quibdójs. I love HTML5 game development and i'm enthusiast doing things from scratch to learn how the wheel is built.</p>\n\n<p>In the past few years, i was involved as frontend developer in projects with different clients like LCEspirito, Jgiraldo Reporta, Kaducollect and some others.</p>","job":"","order":18,"country":{"id":1,"country":"Colombia"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":3,"name":"Workshops Room 1","description":"Second Floor"}},{"name":"No more flat web navigation, add 3D interaction as easy as 1, 2, Three.js","description":"<p>A workshop on how to set up a Node.js server and client-side JS code to display and interact with any filename extension 3D model (CAD) using a WebGL and Three.js API.</p>\n\n<p>The API allows developers to create interactive websites for all kinds of different markets where 3D interaction could be added.</p>\n\n<p>The Web world has changed. Now that all the most popular web browsers support WebGL, 3D on the web is a reality. With this workshop, JS and 3D enthusiasts will be able to create interactive web application and also get a head start to VR apps.</p>\n\n<p>I will share my knowledge using a WebGL and Three.js based API that consists of two APIs, I will guide attendees through the entire process of building a simple application, including writing and running viewer extensions.</p>\n\n<h3>2 steps Outline</h3>\n\n<ul>\n<li>First using the REST API we’ll setup a Node.js server. This allows you to upload and translate 2D/3D models into a light-weight format to later on be downloaded and displayed on the Client Side API (2nd API).</li>\n</ul>\n\n<p>-The second API is a client-side JS API that allows you to embed, customize through JS extensions and automate an interactive 2D/3D model viewer on your web page.</p>\n\n<p>The intended audience for this workshop would be JS and 3D enthusiasts with the desire of taking their Web apps to the next level, where they’ll be able to create attractive and eye-candy web apps and also get a head start to the design of their own VR apps.</p>\n\n<p>When the attendees finish the workshop they will be able to:</p>\n\n<ul>\n<li>Create a dynamic application that works in all updated browsers.</li>\n<li>View 2D/3D models in a browser or device without plug-in or additional software.</li>\n<li>Create and run Node.js application.</li>\n<li>Extend API WEBGL viewer to interact with the 2D/3D models.</li>\n<li>Identify resources for learning more about the the API.</li>\n<li>Get the necessary tools and knowledge to create their own VR Apps using the Technology.</li>\n</ul>","_type":"Workshop","time":"09:00:00","speaker":{"id":11,"name":"Jaime Rosales","alias":"","twitter_user":"afrojme","linkedin_user":"https://www.linkedin.com/in/jaimerosales","image":"http://jsconf.co/media/speaker/JaimeRosales.jpg","about":"<p>Hispanic, Sr. Technical Evangelist at <a href=\"https://www.autodesk.com/\">Autodesk</a> who has promoted many of the company's  Web services technologies. View &amp; Data API being the most attractive one to the JS community. Actively, he spends part of his time presenting in different parts of the US, big cities like NYC, Chicago, San Francisco and Sillicon Valley being some of the main ones, about the implementation of 3D content for web apps. He is part of the well-known group of developers from the AEC &amp; VR Hackathons that occur around the world.</p>","job":"Autodesk","order":15,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":4,"name":"Workshops Room 2","description":"Second Floor"}},{"name":"Coffee","description":"","_type":"Coffee","time":"10:45:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"Server-side JavaScript with Node.js","description":"<p>If you are a JavaScript developer that doesn't know how and why to use the Node.js platform, your days are numbered. Node.js is skyrocketing in popularity and its package management system (npm) just became the largest platform repository in the world with downloads increasing 200% every week. Despite how intimidating it can look, a basic knowledge of web servers, the HTTP protocol and JavaScript is all you need to get your Node.js server up and running.</p>\n<p>In this workshop, you will learn about the basics of web servers &amp; the HTTP protocol, what Node.js is &amp; when to us it, building web server application with Node.js and launching it into the cloud.</p>","_type":"Workshop","time":"11:05:00","speaker":{"id":23,"name":"Ben Rondeau","alias":"Ben","twitter_user":"_benrondeau","linkedin_user":"","image":"http://jsconf.co/media/speaker/BenRondeau.jpg","about":"<p>Christ Follower • Developer Advocate @IBMBluemix • @TxSt Comdes Alum • Triathloner • Scuba Diver &amp; PADI Instructor • Bulldog Lover • @Jeep Owner • @Rangers Fan!</p>","job":"IBM Bluemix","order":20,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":4,"name":"Workshops Room 2","description":"Second Floor"}},{"name":"The anatomy of an A/B test","description":"<p>“In God we trust, all others must bring data”. Intuition, \nexperience and well known patterns may give us good indications of \nsuccessful ideas and features, but nothing gets closer to the truth than\ndata analysis and A/B testing.\nIn this workshop, we’ll show how we do experimentation at Booking: what we test,\n how to get data through templates and JavaScript, and how we analyse \nthe resulting metrics. We’ll live-code examples, see all potential \ncaveats of dealing with the user tracking on the client-side, and show \nexistent tools you can use to test your own ideas.</p>","_type":"Workshop","time":"11:05:00","speaker":{"id":18,"name":"Eduardo Shiota","alias":"Shiota","twitter_user":"@shiota","linkedin_user":"","image":"http://jsconf.co/media/speaker/EduardoShiota.jpg","about":"<p>A Designer/Front-end Engineer, half-assed writer, hacking at <a href=\"http://booking.com\">Booking</a>, who left the land of samba to live in the land of bikes. Works with the web, is a crazy cat guy, loves sushi, and hates parsley.</p>","job":"Booking.com","order":17,"country":{"id":9,"country":"Netherland"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":3,"name":"Workshops Room 1","description":"Second Floor"}},{"name":"Jugando a ser artistas: Canvas + LEDs RGB","description":"<p>En el taller se trabajará usando p5.js, una librería que hace accesible a artistas, diseñadores y principiantes crear contenido altamente interactivo para web. Además, se complementará el contenido mezclándolo con interacción con el mundo haciendo uso de LEDs RGB cuyo comportamiento es modificado por la interacción el navegador y los sketches construidos con p5.js.</p>\n\n<p>Partes del taller:</p>\n\n<ol>\n<li>Conociendo p5.js</li>\n<li>Trabajando con Canvas</li>\n<li>LEDs RGB: conectando el Hardware</li>\n<li>node.js el puente entre los dos mundos</li>\n<li>Agregando interacciones</li>\n</ol>\n\n<p>Principiantes bienvenidos. La audiencia podrá crear sketches básicos de p5.js, conocer el flujo de la librería y complementar el funcionamiento con hardware(LEDs RGB). El énfasis es crear y tener la interacción del navegador con cosas del mundo real, más qué conocer interioridades del funcionamiento de todo nos apoyaremos en librerías para facilitar la interacción con componentes de HTML que enriquezcan la experiencia.</p>","_type":"Workshop","time":"11:05:00","speaker":{"id":9,"name":"Adrian Catalan","alias":"ykro","twitter_user":"ykro","linkedin_user":"","image":"http://jsconf.co/media/speaker/AdrianCatalan.jpeg","about":"<p>Android GDE, @bitandik &amp; @elementalgeeks co-founder, @InnovationLabUG lead, @cultura_android, @NodeBotsGT, @jspuntogt &amp; @fit_gt co-organizer</p>","job":"Bit & Ik'","order":13,"country":{"id":7,"country":"Guatemala"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":5,"name":"Workshops Room 3","description":"Second Floor"}},{"name":"Lunch","description":"","_type":"Lunch","time":"12:35:00","speaker":null,"room":null},{"name":"Perfschool: find your way through the performance optimization maze!","description":"This workshop is a spin-off of one of my talks, \"High Performance in the Critical Path\". The perfschool workshopper was originally written for CampJS V, and it features ten exercises in a NodeSchool fashion where you will be guided through different scenarios where a performance challenge needs to be solved. The problems range from measuring performance and enforcing a performance budget to bringing website responses to 10% of their original content weight.\r\n\r\nIntended audience is anyone who cares about the performance of their web applications and is willing to learn how to improve their sites.\r\n\r\n","_type":"Workshop","time":"13:30:00","speaker":{"id":6,"name":"Nicolas Bevacqua","alias":"","twitter_user":"nzgb","linkedin_user":"https://www.linkedin.com/in/nbevacqua","image":"http://jsconf.co/media/speaker/NicolasBevacqua.jpg","about":"<p>\"Nico is an enthusiastic JavaScript hacker based in Buenos Aires, Argentina. When he's not hacking away at freelance projects, or contributing to the open source community as <a href=\"https://github.com/bevacqua\">@bevacqua</a>, Nico spends time writing content for <a href=\"http://ponyfoo.com/\">Pony Foo</a>  and devoting time to local communities such as <a href=\"http://nodeschool.io/buenosaires/\">NodeSchool</a>, as well as <a href=\"https://github.com/beerjs/buenosaires\">Beer.js</a>; and he’s published a book, <a href=\"http://bevacqua.io/bf\"><strong>JavaScript Application Design</strong></a>. Nico is a happy pony, and you can find him as <a href=\"https://twitter.com/nzgb\">@nzgb</a> on Twitter, because <a href=\"http://xkcd.com\">xkcd</a>.</p>\n<p>\"</p>","job":"JavaScript Consultant","order":10,"country":{"id":5,"country":"Argentina"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":4,"name":"Workshops Room 2","description":"Second Floor"}},{"name":"Crear un mini lenguage de programación usando Jison","description":"<p>Jison toma una gramática libre en un archivo con lenguaje definido para luego generar/traducirlo en un nuevo archivo de Javascript. Si estas familiarizado con Bison o Yacc, u otros, Jison no es diferente.</p>\n\n<p>¿Algúna vez te has preguntado como funciona el compilador de CoffeeScript? En este taller vamos a crear un mini lenguaje de programación con una sintaxis abierta, totalmente expandible en diferentes situaciones.</p>\n\n<p>Al terminar este taller, el asistente habrá aprendido:</p>\n\n<ol>\n<li>Creación de ​<strong>grammars</strong></li>\n<li>Jison + Regular Expressions</li>\n<li>Abstrac Syntax Tree</li>\n<li>Traducir un lenguaje X a JS</li>\n</ol>","_type":"Workshop","time":"13:30:00","speaker":{"id":7,"name":"Giovanny Gongora","alias":"Gioyik","twitter_user":"Gioyik","linkedin_user":"https://www.linkedin.com/in/gioyik","image":"http://jsconf.co/media/speaker/GiovannyGongora.jpg","about":"<p>I'm Giovanny Gongora, aka Gioyik. I am speaker and code contributor at <a href=\"https://www.mozilla.org\">Mozilla</a>. Javascriptero since creation of the universe. Time ago translator at <a href=\"https://www.torproject.org/\">Tor Project</a> and Security tester. I enjoy trying new things like <a href=\"https://www.rust-lang.org/\">Rust</a> and <a href=\"http://golang.org/\">Go</a>, sometimes creating custom languages and working on my own projects.</p>\n<p>I give talks about web technologies, open source, net neutrality, programming languages that suck and how <a href=\"http://goo.gl/MQjSy8\">cats</a> will control the world in the future.</p>","job":"Mozilla","order":11,"country":{"id":1,"country":"Colombia"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":5,"name":"Workshops Room 3","description":"Second Floor"}},{"name":"Full-stack apps: Angular-Meteor","description":"<p>Meteor permite desarrollar aplicaciones full-stack de tiempo real en javascript de manera rápida y sencilla para web y móviles. Por su parte, con Angular, un framework JS para front-end, es posible crear apps bastante expresivas, fáciles de escribir y leer. Hace pocos días se lanzó la versión 1.0.0 de angular-meteor, que aprovecha las mejores cualidades de cada uno para crear aplicaciones increíbles.</p>\n<p>En este workshop lograremos desarrollar un MVP con angular-meteor.</p>\n<p>Al final del workshop el asistente aprenderá sobre los principios y conceptos básicos de estas dos herramientas y la manera en la que trabajan juntas. Tendrá la capacidad de desarrollar aplicaciones de tiempo real con muy poco código.</p>","_type":"Workshop","time":"13:30:00","speaker":{"id":21,"name":"Claudia Lagos","alias":"","twitter_user":"@ClaudiaLagosR","linkedin_user":"","image":"http://jsconf.co/media/speaker/ClaudiaLagos.jpg","about":"<p>I'm an electronic engineer, but a few years ago, I discovered my real passion. Since then, I have become a developer. I've worked on multiple apps in the transportation sector as a full-stack and front-end developer.</p>\n<p>Now I'm working at Tappsi doing really cool (JS) stuff!</p>","job":"Tappsi","order":7,"country":{"id":1,"country":"Colombia"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":3,"name":"Workshops Room 1","description":"Second Floor"}},{"name":"Hack Space Room 4","description":"<p>This is a friendly space to hack and work together, no pre-registration required.</p>","_type":"Other","time":"14:00:00","speaker":null,"room":{"id":6,"name":"HackSpace Room 4","description":"Second Floor"}},{"name":"Coffee","description":"","_type":"Coffee","time":"15:05:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"learnuv for fun and profit","description":"<p>This is a workshop for the libuv library which is part of node.js.\nIt will use the work shopper I created, <a href=\"https://github.com/thlorenz/learnuv\">learnuv</a> to teach attendees about libuv.</p>\n\n<p>Even if developers aren't familiar with C yet, they should attend as I'll introduce most of the key concepts needed to work with libuv before launching into the workshop.</p>\n\n<p>Node.js leverages multiple libraries in order to perform its job.</p>\n\n<p>libuv is one of them, quoting from its <a href=\"https://github.com/joyent/libuv\">github repository</a>:</p>\n\n<blockquote>\n<p>libuv is a multi-platform support library with a focus on asynchronous I/O. It was primarily developed for use by Node.js, but it's also used by Mozilla's Rust language, Luvit, Julia, pyuv, and others.</p>\n</blockquote>\n\n<p>libuv is basically the interface to the underlying system by providing n API to perform asynchronous file system operations, access TCP or UDP sockets, IPC, listen to file system events and more. \nAdditionally it provides an event-loop implementation backed by kernel eventing mechanisms like epoll and kqueue.</p>\n\n<p><em>It is no overstatement to call libuv the powerhouse of Node.js</em> and thus it is important to understand it in order to understand how Node.js works.\nThe best way to get a better understanding is to use libuv as a library in C programs.</p>\n\n<p>The libuv workshopper will have you do exactly that. You'll be reading files, download webpages and other fun stuff and all that via simple C programs.</p>\n\n<p>After completing the workshop you should have a much better understanding of libuv and thus the inner workings of Node.js and be equipped to troubleshoot any problems you may run into in the future in a more educated manner.</p>","_type":"Workshop","time":"15:25:00","speaker":{"id":10,"name":"Thorsten Lorenz","alias":"thlorenz","twitter_user":"thlorenz","linkedin_user":"","image":"http://jsconf.co/media/speaker/ThorstenLorenz.jpg","about":"<p>\"Thorsten is a Jazz musician turned developer and is excited about Node.js and its community The fast turnaround from idea to working module has proven addictive for him and led to lots of modules which ended up on github and/or npm. He also contributes to other awesome open source efforts like browserify to which he added source map support.</p>\n<p>Lately he has been focusing on understanding the Node.js stack in more depth, focusing on libuv and v8.</p>\n<p>Thorsten works for NodeSource.\"</p>","job":"NodeSource","order":14,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":5,"name":"Workshops Room 3","description":"Second Floor"}},{"name":"Programming art and music with Javascript","description":"<p>p5.js is a JavaScript library that starts with the original goal of Processing, to make coding accessible for artists, designers, educators, and beginners, and reinterprets this for today’s web. </p>\n<p>In this workshop you will learn to create art and music using JavaScript (srsly).</p>\n<p>At the end of the workshop attendees will be able to:</p>\n<ul>\n<li>Create a draw canvas, file loading</li>\n<li>Mouse and touch interaction (p5.js has a set of methods for handling mouse and touch interaction)</li>\n<li>Use p5.sound library that provides a friendly interface to HTML5 web audio API for loading, playing, and synthesizing sounds.</li>\n</ul>","_type":"Workshop","time":"15:25:00","speaker":{"id":20,"name":"Isabel Palomar","alias":"Isa","twitter_user":"isabelpalomar","linkedin_user":"https://www.linkedin.com/in/isabelpalomar","image":"http://jsconf.co/media/speaker/IsabelPalomar.jpg","about":"<p>Isabel Palomar is a Mexican Software Engineer based in Philadelphia, USA. She loves to participate in communities and share knowledge. Daydreamer, nightthinker! (Little bit crazy, but don't tell anybody)</p>\n\n<p><a href=\"http://techwomen.org.mx/\">Tech Women Community</a> Co-Founder &lt;3. </p>\n\n<p>She likes sushi, cats and traveling!</p>","job":"Tech Women","order":19,"country":{"id":11,"country":"Mexico"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":3,"name":"Workshops Room 1","description":"Second Floor"}},{"name":"Hack Space Room 4","description":"<p>This is a friendly space to hack and work together, no pre-registration required.</p>","_type":"Other","time":"15:25:00","speaker":null,"room":{"id":6,"name":"HackSpace Room 4","description":"Second Floor"}},{"name":"Data Visualization is beautiful and it's even better with Javascript","description":"Data visualization is like having a high bandwidth connection between your application data and your users, so there is no reason to deprive them from this amazing communication tool. In this workshop we will learn how to build data visualizations in the easier - not that configurable way using libraries such as Nvd3.js, C3.js and Vega.js, and in the not that hard - very customizable way using D3.js. We will wrap this workshop by learning the main concepts about scales, domains, colors, charts and data management and how to provide the best experience for users with our visualizations.\r\n\r\nThis workshop will help developers to learn the basic programming skills and the main concepts to build data visualizations using JavaScript and will motivate them to include charts and dashboards in the current and future projects. It is mainly focused in beginners but senior developers can learn some things to about visualization concepts.\r\n","_type":"Workshop","time":"15:25:00","speaker":{"id":17,"name":"Jaime Garcia","alias":"","twitter_user":"sw_advisor","linkedin_user":"http://co.linkedin.com/pub/jaime-andr%C3%A9s-garc%C3%ADa-mej%C3%ADa/2a/657/829","image":"http://jsconf.co/media/speaker/jaime-garcia.png","about":"<p>Electronic Engineer and Master in Administrative Engineering. Data Visualization and Hardware Developer. He has 8 years of experience working in real-time supervision and data visualization for the transport sector, 1 year of experience as university professor and 4 years of research experience in behavioral economics and decision-making. Regular speaker in local events and in some international ones such as IEEE ITM in the Netherlands and the Scrum Gathering in Ecuador.</p>","job":"Analytic Board","order":16,"country":{"id":1,"country":"Colombia"},"speaker_type":[{"id":2,"_type":"Workshoper"}]},"room":{"id":4,"name":"Workshops Room 2","description":"Second Floor"}}]},{"_date":"2015-10-17 00:00 ","items":[{"name":"Registration","description":"","_type":"Other","time":"08:15:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"JSConf.co Team Welcoming","description":"","_type":"Other","time":"09:00:00","speaker":null,"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Keynote","description":"","_type":"Talk","time":"09:20:00","speaker":{"id":19,"name":"Brendan Eich","alias":"Creator of JavaScript","twitter_user":"BrendanEich","linkedin_user":"https://www.linkedin.com/pub/brendan-eich/0/70/a46","image":"http://jsconf.co/media/speaker/Brendan_Eich_Mozilla_Foundation_official_photo.jpg","about":"<p>Brendan Eich invented JavaScript, co-founded <a href=\"http://mozilla.org\">http://mozilla.org</a> , and served as CTO, SVP Eng, and CEO, Mozilla.</p>","job":"","order":0,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Learn about CPUs and Assembly on an interactive Playground in the Browser","description":"<p><a href=\"https://thlorenz.github.io/visulator\"><img alt=\"visulator-talk\" src=\"https://cloud.githubusercontent.com/assets/192891/8335619/1506e51a-1a5c-11e5-8a6f-251eb03659a5.gif\" /></a></p>\n<p>Visulator is a visual CPU emulator designed as an interactive resource to learn about assembly language and the CPU.</p>\n<p>Not only can you play with the examples and see whats going on inside the CPU but also detailed [documentation] and links to other resources are included with the repo.</p>\n<p>The animations are designed to help you understand how registers and flags are affected by each instruction.</p>\n<p>In this talk I will explain how <a href=\"https://thlorenz.github.io/visulator\">visulator</a> was built using current web technologies and give some insight into how a CPU processes assembly instructions.</p>\n<p>It will have two sections. In one I'll demystify how CPUs work and how assembly language relates to the processed instructions. In the other I'll detail how <a href=\"https://thlorenz.github.io/visulator\">visulator</a> was built and how it works.</p>\n<h3>CPUs and Assembly</h3>\n<ul>\n<li>assembly <em>assembled</em> to opcodes</li>\n<li>opcodes read and processed by the CPU</li>\n<li>registers and/or memory updated after each instruction is processed</li>\n<li>flags set depending on outcome of instruction to affect next instruction</li>\n<li>high level explanation of techniques like pipelining which improve CPU performance</li>\n</ul>\n<h3>Visulator</h3>\n<ul>\n<li>JavaScript built, tests powered by node, web app powered by browserify</li>\n<li>all animations are CSS based</li>\n<li>disassembler uses <a href=\"http://www.capstone-engine.org/index.html\">capstone</a> compiled to JavaScript via <a href=\"https://kripken.github.io/emscripten-site/\">emscripten</a></li>\n<li>tests are generated from assembly examples via <a href=\"https://github.com/thlorenz/gai\">gai</a>, a GDB scripting tool I wrote, which also produces the below output in order to make it easier to understand the CPU you want to emulate</li>\n<li>instructions are <em>really</em> emulated as you step through the assembly</li>\n<li>built for learning not for speed, code authored for readability as well and heavily commented</li>\n<li>the project has <em>Mad Science</em> status and lots of work remains as there are <a href=\"http://ref.x86asm.net/geek32.html\">hundreds of instructions</a> that still need to be implemented</li>\n<li>end goal is to allow loading arbitrary binaries and support editing assembly</li>\n</ul>\n<p><a href=\"https://github.com/thlorenz/gai\"><img alt=\"gai\" src=\"https://github.com/thlorenz/gai/raw/master/assets/strlen.png\" /></a></p>","_type":"Talk","time":"09:55:00","speaker":{"id":10,"name":"Thorsten Lorenz","alias":"thlorenz","twitter_user":"thlorenz","linkedin_user":"","image":"http://jsconf.co/media/speaker/ThorstenLorenz.jpg","about":"<p>\"Thorsten is a Jazz musician turned developer and is excited about Node.js and its community The fast turnaround from idea to working module has proven addictive for him and led to lots of modules which ended up on github and/or npm. He also contributes to other awesome open source efforts like browserify to which he added source map support.</p>\n<p>Lately he has been focusing on understanding the Node.js stack in more depth, focusing on libuv and v8.</p>\n<p>Thorsten works for NodeSource.\"</p>","job":"NodeSource","order":14,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"No more flat web navigation, add 3D interaction as easy as 1, 2, Three.js","description":"<p>The Web world has changed. Now that all the most popular web  browsers support WebGL, 3D on the web is a reality. With this talk, JS and 3D enthusiasts will be able to create interactive web application and also get a head start to create their own VR apps.</p>\n<p>I will share my knowledge using a WebGL and Three.js based API that consists of two APIs, I will guide attendees through the necessary tools the entire process of building a simple application, including writing and running viewer extensions.</p>\n<p>The intended audience for this talk would be JS and 3D enthusiasts with the desire of taking their Web apps to the next level, where they’ll be able to learn how to create attractive and eye-candy web apps and also get a head start to the design of their own VR apps.</p>","_type":"Talk","time":"10:30:00","speaker":{"id":11,"name":"Jaime Rosales","alias":"","twitter_user":"afrojme","linkedin_user":"https://www.linkedin.com/in/jaimerosales","image":"http://jsconf.co/media/speaker/JaimeRosales.jpg","about":"<p>Hispanic, Sr. Technical Evangelist at <a href=\"https://www.autodesk.com/\">Autodesk</a> who has promoted many of the company's  Web services technologies. View &amp; Data API being the most attractive one to the JS community. Actively, he spends part of his time presenting in different parts of the US, big cities like NYC, Chicago, San Francisco and Sillicon Valley being some of the main ones, about the implementation of 3D content for web apps. He is part of the well-known group of developers from the AEC &amp; VR Hackathons that occur around the world.</p>","job":"Autodesk","order":15,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Coffee","description":"","_type":"Coffee","time":"11:05:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"BitTorrents Apps con Javascript","description":"En esta charla será una breve introducción a la tecnología BitTorrent, mostrando los distintos usos que se le ha dado a esta tecnología a lo largo de la historia.\r\n\r\nMostraremos distintos proyectos interesantes hechos con javascript para sacarle provecho al protocolo BitTorrent, y otros proyectos que usan esta tecnología para resolver problemas como deploy de aplicaciones a miles de servidores.\r\n\r\nPor último, un pequeño demo realizado con la librería Torque y Btapps, la cual permite usar el navegador web como un cliente torrent y nos permite crear aplicaciones interesantes.","_type":"Talk","time":"11:25:00","speaker":{"id":14,"name":"Luis A. Porras","alias":"","twitter_user":"lporras16","linkedin_user":"https://cl.linkedin.com/in/lporras","image":"http://jsconf.co/media/speaker/LuisPorras.jpg","about":"<p>\"Luis is a Software Engineer based in Santiago de Chile, born in Barranquilla - Colombia.  He has been working with Ruby on Rails since 2010 but currently works as Node.js Engineer at <a href=\"http://selfie.com\">Selfie Inc</a></p>\n<p>Passionate about bring to live great solutions that make real impact, also is one of the organizers of <a href=\"http://www.meetup.com/dynlangchile/\">JS Meetups</a> in Santiago, podcaster at <a href=\"https://itunes.apple.com/us/podcast/noderscast/id1009061967?mt=2\">Noderscast</a> and Rails Instructor in <a href=\"http://worldtechmakers.com\">World Tech Makers</a>.</p>\n<p>\"</p>","job":"Selfie Inc","order":5,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"These Bots are Made for Walkin'","description":"Johnny-Five's new Animation class gives us the ability to sequence complex movements across multiple servos and the new Tharp inverse kinematics (IK) library gives us the ability automatically position kinematics chains (arms and legs) in 3D coordinate space. What's that good for? Walking robots of course!\r\n\r\nThis first part of this talk is follow up to Rick Waldron's \"Bits of Nodebots Next\". We've moved the mark from \"This is possible in Johnny-Five!\" to \"This is built into Johnny-Five!\". I will also introduce Ronald Jaramillo's Go-Johnny-Go which gives us a nice, browser-based GUI for constructing animations.\r\n\r\nThis second part of the talk covers inverse kinematics in Johnny-Five using the Tharp library. Inverse Kinematics gives us the ability to pass in a coordinate in 3D space and and have all our joints positioned automatically. This is the next step in creating robots that aware of, and interact with their environment.\r\n\r\nThis talk includes live demos of Johnny-Five controlling a hexapod with scripted movements, constructing a simple animation in Go-Johnny-Go, and a demo of the same hexapod being controlled by Tharp.\r\n","_type":"Talk","time":"12:00:00","speaker":{"id":5,"name":"Donovan Buck","alias":"","twitter_user":"dtex","linkedin_user":"https://www.linkedin.com/pub/donovan-buck/1/9b1/766","image":"http://jsconf.co/media/speaker/DonovanBuck.JPG","about":"<p>Donovan is an Application Engineer at <a href=\"http://www.brandextract.com\">BrandExtract</a> who is mildly obsessed with Javascript robotics. He is a core contributor to Johnny-Five, co-author of <a href=\"http://www.makershed.com/products/make-javascript-robotics\">Make:Javascript Robotics</a> and creator of <a href=\"http://dtex.us/schiffer-ipsum\">Schiffer-Ipsum</a>, the ninth-best lorem ipsum generator on the internet.</p>","job":"BrandExtract","order":9,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"TBA","description":"","_type":"Talk","time":"12:35:00","speaker":{"id":2,"name":"Jenn Schiffer","alias":"","twitter_user":"jennschiffer","linkedin_user":"https://www.linkedin.com/in/jennschiffer","image":"http://jsconf.co/media/speaker/jenn_1.png","about":"<p>Hi, I'm Jenn, aka jennmoneydollars. I'm a web developer who lives in New Jersey on purpose and works full-time as an open web engineer at <a href=\"http://bocoup.com/\">Bocoup</a>. When I'm not building open web apps with the coolest web developers and clients in the game, I'm making art with code, telling jokes, and getting yelled at on the Internet.</p>\n<p>In a past life, I was a senior front-end developer at the <a href=\"http://stats.nba.com/\">NBA</a> and, before that, taught and evaluated computer science education at Montclair State University – where I got my BS and MS in Computer Science. I'm the organizer of <a href=\"http://jerseyscript.github.io/\">JerseyScript</a>, a front-end developer meetup based in New Jersey – one of several ventures I'm involved in to attract and retain more people in the web development community.</p>\n<p>Lately I've been focusing on making tools to teach and facilitate the creation and knowledge of art and code, <a href=\"http://saidby.jennschiffer.com/\">speaking about and teaching</a> web development all over the place, and <a href=\"https://medium.com/@jennschiffer/latest\">trying to help my peers take themselves a little less seriously</a>.</p>\n<p>If you're not a recruiter and want to say hi, I'm most responsive <a href=\"http://twitter.com/jennschiffer\">on twitter</a>, and you can email me at <a href=\"mailto:jenn@dotbiz.info\">jenn@dotbiz.info</a> or message jennmoneydollars on Freenode.</p>","job":"Bocoup","order":3,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Lunch","description":"","_type":"Lunch","time":"13:10:00","speaker":null,"room":null},{"name":"NERD DISCO: Reloaded","description":"Finest music visualizations on HTML canvas in sync with music from SoundCloud using the Web Audio API and manipulated with a MIDI controller (KORG nanoPAD2) using the Web MIDI API. The visualizations are send in real time (socket.io) from the browser to a server (Node.js), which controls a LED cube (Raspberry Pi + 5 x Adafruit NeoPixel = 320 LEDs) over WiFi.\r\n\r\nThis talk has two intentions: Inspiration and knowledge share. I explain how the whole system is build from the ground up in easy to follow steps. Everything will be covered by live demos, code slides and images to explain the system behind NERD DISCO. But why? I want to show that it's easy to learn new stuff and that you only need to know JS to do everything you want. This talk connects the web to real world affordable hardware. Everything is open-source and people can build this at home if they like.\r\n\r\n","_type":"Talk","time":"14:10:00","speaker":{"id":8,"name":"Tim Pietrusky","alias":"","twitter_user":"TimPietrusky","linkedin_user":"https://www.linkedin.com/pub/tim-pietrusky/50/2a8/785","image":"http://jsconf.co/media/speaker/timpietrusky.jpg","about":"<p>Web creator that works <a href=\"http://synoa.de\">in an office</a> by day and on <a href=\"https://twitter.com/NERDDISCO\">NERD DISCO</a> by night. Loves to connect any kind of systems with each other and wants to learn everything related to the web. Can't live without electronic music from <a href=\"https://soundcloud.com/timpietrusky\">SoundCloud</a>. Master of Coin <a href=\"https://twitter.com/bullgit\">@bullgit</a>. &lt;3 his cat <a href=\"https://twitter.com/KazzoTheCat\">Kazzo</a>. </p>","job":"Synoa","order":12,"country":{"id":6,"country":"Germany"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"High Performance in the Critical Rendering Path","description":"This talk covers the past, present and future of web application performance when it comes to delivery optimization. I'll start by glancing over what you're already doing -- minifying your static assets, bundling them together, and using progressive enhancement techniques. Then I'll move on to what you should be doing -- optimizing TCP network delivery, inlining critical CSS, deferring font loading and CSS so that you don't block the rendering path, and of course deferring JavaScript. Afterwards we'll look at the future, and what HTTP 2.0 has in store for us, going full circle and letting us.\r\n","_type":"Talk","time":"14:45:00","speaker":{"id":6,"name":"Nicolas Bevacqua","alias":"","twitter_user":"nzgb","linkedin_user":"https://www.linkedin.com/in/nbevacqua","image":"http://jsconf.co/media/speaker/NicolasBevacqua.jpg","about":"<p>\"Nico is an enthusiastic JavaScript hacker based in Buenos Aires, Argentina. When he's not hacking away at freelance projects, or contributing to the open source community as <a href=\"https://github.com/bevacqua\">@bevacqua</a>, Nico spends time writing content for <a href=\"http://ponyfoo.com/\">Pony Foo</a>  and devoting time to local communities such as <a href=\"http://nodeschool.io/buenosaires/\">NodeSchool</a>, as well as <a href=\"https://github.com/beerjs/buenosaires\">Beer.js</a>; and he’s published a book, <a href=\"http://bevacqua.io/bf\"><strong>JavaScript Application Design</strong></a>. Nico is a happy pony, and you can find him as <a href=\"https://twitter.com/nzgb\">@nzgb</a> on Twitter, because <a href=\"http://xkcd.com\">xkcd</a>.</p>\n<p>\"</p>","job":"JavaScript Consultant","order":10,"country":{"id":5,"country":"Argentina"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Hacking Your Front-End Apps","description":"We spend a lot of time learning how to build web apps, but we don't spend very much time learning how to make them secure. There are lots of really surprising and unexpected ways that someone can hack your site. There are also some cool new standards to help us start to fight back!","_type":"Talk","time":"15:20:00","speaker":{"id":3,"name":"Alex Sexton","alias":"SlexAxton","twitter_user":"SlexAxton","linkedin_user":"https://www.linkedin.com/in/alexsexton","image":"http://jsconf.co/media/speaker/0Q2OtU87.jpg","about":"<p>Alex Sexton lives in Austin TX, and is an engineer at <a href=\"https://stripe.com/\">Stripe</a>. He is on the <a href=\"http://modernizr.com/\">Modernizr</a> core team, the  <a href=\"https://jquery.org/team/\">jQuery Board of Directors</a>, as well as the <a href=\"http://dojofoundation.org/about/board-members\">Dojo Foundation Board</a>.</p>\n<p>His recent favorite projects include the  <a href=\"https://github.com/SlexAxton/messageformat.js\">messageformat.js</a> i18n library and the <a href=\"https://github.com/SlexAxton/require-handlebars-plugin\">require-handelbars-plugin</a>. He also runs the <a href=\"http://texasjavascript.com/\">Texas JavaScript Conference (TXJS)</a> annually in Austin, and helps organize the <a href=\"http://austinjavascript.com/\">Austin JavaScript</a> monthly meetup.</p>\n<p>I’m SlexAxton many places, including <a href=\"https://github.com/SlexAxton\">Github</a>,  <a href=\"https://www.google.com/+AlexSexton\">Google Plus</a>, and <a href=\"https://www.flickr.com/photos/slexaxton/\">Flickr</a>.</p>","job":"Stripe","order":2,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Coffee","description":"","_type":"Coffee","time":"15:55:00","speaker":null,"room":{"id":2,"name":"Lobby","description":"First floor"}},{"name":"Reactive JavaScript at Netflix, Microsoft and the World","description":"<p>What’s does a mouse drag event have in common with an Array of numbers? The answer to this question may surprise you: they are both collections. This key insight holds the key to dramatically simplifying asynchronous programming in JavaScript. We will talk about its usage at Netflix and Microsoft solving concrete examples</p>","_type":"Talk","time":"16:15:00","speaker":{"id":15,"name":"Matthew Podwysocki","alias":"Matt","twitter_user":"mattpodwysocki","linkedin_user":"","image":"http://jsconf.co/media/speaker/mattPodwjpeg","about":"<p>Matthew Podwysocki is a Principal Software Engineer at self described Open Sourcerer at Microsoft. He currently works with the DX/TED team focusing on the Internet of Things, Reactive Programming at Scale and teaching the next generation how to code!</p>","job":"Microsoft Corporation","order":4,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"},{"id":2,"_type":"Workshoper"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Signal Processing with JavaScript","description":"<p>Nowadays we have native options to deal with media signals on javascript! How can we use the available APIs to process it? This talk is about amazing uses to Web Audio API and the Video tag like sampling, quantization, filtering, etc. Can we synthesize guitar effects? How javascript running on hardware can deal with this processing?</p>","_type":"Talk","time":"16:50:00","speaker":{"id":4,"name":"Rafael Silva","alias":"","twitter_user":"rafael_sps","linkedin_user":"https://br.linkedin.com/in/rsdasilva","image":"http://jsconf.co/media/speaker/RafaelSilva","about":"<p>Graduated as a telecommunication technologist, has 5 years working as web developer while trying to collaborate with the open web!</p>","job":"IWS Isobar","order":8,"country":{"id":3,"country":"Brazil"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Getting over Moore's Law: Parallelization using JavaScript in the browser","description":"<p>Modern computers and devices continue the trend of having a larger number of CPU cores instead of cores with more computing power. That means the days of waiting for Moore's Law to take effect so our apps run faster are over, and we, developers, need to start adventuring into the land of parallelism.</p>\n<p>This talk goes over some of the available approaches (and ongoing efforts) that make it possible to take advantage of parallelism in the browser using JS. This includes not only the widely spread concept of Web Workers, but also SIMD and the downfall of ParallelJS and rise of SharedArrayBuffers.</p>","_type":"Talk","time":"17:25:00","speaker":{"id":13,"name":"Damian Schenkelman","alias":"Yenkel","twitter_user":"dschenkelman","linkedin_user":"","image":"http://jsconf.co/media/speaker/DamianSchenkelman.jpeg","about":"<p>Damian is an engineer at <a href=\"auth0.com\">Auth0</a> working on making the core scalable and performant. He loves learning about JavaScript, its performance specifics and contributing to OSS. He is also a self proclaimed \"Asado Advocate\".</p>","job":"Auth0","order":16,"country":{"id":5,"country":"Argentina"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"No, Really... Robots and JavaScript?!","description":"<p>NodeBots have been around for several years now, but with every presentation, there is always someone who asks, \"But... JavaScript?! Why on earth would you make robots with JavaScript?\"</p>\n<p>It's a fair question, and one worthy of more than a hand-wavy answer about how it's cool... or something.</p>\n<p>In this talk, let's discuss why, of all the languages on the planet, JavaScript is the perfect starting point for a future of robotics.</p>\n<p>As a roboticist-turned-web-developer, I will provide some deep insights not only into the world of robotics, but also into JavaScript and its server-side cousin, Node.js. We'll talk about what JavaScript-enabled robots can already do, what they can't do yet, and what they might be able to do with a bit of elbow grease.</p>\n<p>And, if the demo deities are with us, we may even have a robot assistant on hand.</p>","_type":"Talk","time":"18:00:00","speaker":{"id":1,"name":"Raquel Velez","alias":"","twitter_user":"rockbot","linkedin_user":"https://www.linkedin.com/in/raquelvelez","image":"http://jsconf.co/media/speaker/raquel-velez.jpg","about":"<p>Raquel Vélez is a Senior Software Developer at npm, Inc. in Oakland, CA. She has previously worked at institutions such as Caltech, NASA JPL, the MIT Lincoln Laboratory, and various universities in Europe. In her off time, you can find her baking, teaching NodeBots not to fall off of tables, and speaking. Also, hanging out with her hilarious husband and two cats dressed in dog suits.</p>","job":"npm","order":1,"country":{"id":2,"country":"USA"},"speaker_type":[{"id":1,"_type":"Speaker"}]},"room":{"id":1,"name":"Auditorium","description":"First floor"}},{"name":"Closing Remarks","description":"","_type":"Other","time":"18:35:00","speaker":null,"room":{"id":1,"name":"Auditorium","description":"First floor"}}]}]
